app/controllers/users_controller.rb

UPDATE "users" SET "image" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image", "IMG_3965.jpg"], ["updated_at", "2016-08-01 15:07:31.095339"], ["id", 2]]
---
  def update
    file = params[:user][:image]
    @user.set_image(file)

    if @user.update(user_params)